In [35]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib as matplot
import seaborn as sns

%matplotlib inline

In [36]:
df = pd.read_csv("../input/HR_comma_sep.csv")

In [37]:
df.shape

(14999, 10)

In [38]:
# 统计是否有空值
# df.isnull().any()

# 统计空值个数
# df.isnull().sum()

# 统计空值百分比
df.isnull().sum()/df.shape[0]

satisfaction_level       0.0
last_evaluation          0.0
number_project           0.0
average_montly_hours     0.0
time_spend_company       0.0
Work_accident            0.0
left                     0.0
promotion_last_5years    0.0
sales                    0.0
salary                   0.0
dtype: float64

In [39]:
df.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,sales,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [40]:
# 重命名产生新对象， ===需要重新赋值==
df = df.rename(columns={'satisfaction_level':'satisfaction','last_evaluation': 'evaluation', 'number_project':'projectCount',
                   'average_montly_hours':'averageMonthlyHours',
         'time_spend_company':'yearAtCompany', 'Work_accident':'wordAccident', 'left':'turnover', 'promotion_last_5years':'promotion',
          'sales': 'department'})

In [43]:
front  = df['turnover']

# inplace 是否替换原对象
df.drop(labels = ['turnover'], axis=1, inplace=True)
df.insert(0 , 'turnover', front)
df.head()

,turnover,satisfaction,evaluation,projectCount,averageMonthlyHours,yearAtCompany,wordAccident,promotion,department,salary
0,1,0.38,0.53,2,157,3,0,0,sales,low
1,1,0.80,0.86,5,262,6,0,0,sales,medium
2,1,0.11,0.88,7,272,4,0,0,sales,medium
3,1,0.72,0.87,5,223,5,0,0,sales,low
4,1,0.37,0.52,2,159,3,0,0,sales,low

In [50]:
# 在职/离职
df.turnover.value_counts()

0    11428
1     3571
Name: turnover, dtype: int64